_Rarzrabotki/Rarus/USO2/Catalogs/СМ_BIM_ТипыКонструктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_BIM_ТипыКонструктивов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРенга</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКлассаРенга</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_BIM_ТипыКонструктивов/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Заполняет типами элементов согласно SDK текущей версии Renga Software.
//
// Параметры:
//		Нет.
//
// Возвращаемое значение:
//		Истина - выполнено успешно, Ложь - не выполнено.
//
Функция ЗаполнитьДаннымиRenga() Экспорт

	Макет			= Справочники.СМ_BIM_ТипыКонструктивов.ПолучитьМакет("МакетRenga");
	
	//
	Для НомерСтроки = 1 По 30 Цикл
		
		Наименование 		= ВРег(Макет.ПолучитьОбласть(НомерСтроки,1,НомерСтроки,1).ТекущаяОбласть.Текст);
		ИмяКлассаРенга		= Макет.ПолучитьОбласть(НомерСтроки,2,НомерСтроки,2).ТекущаяОбласть.Текст;
		ИдентификаторРенга 	= Макет.ПолучитьОбласть(НомерСтроки,3,НомерСтроки,3).ТекущаяОбласть.Текст;
		
		ТипСсылка = Справочники.СМ_BIM_ТипыКонструктивов.НайтиПоНаименованию(Наименование);
		
		Если ЗначениеЗаполнено(ТипСсылка) Тогда
		
			СпрОбъект = ТипСсылка.ПолучитьОбъект();
			
		Иначе
			
			СпрОбъект = Справочники.СМ_BIM_ТипыКонструктивов.СоздатьЭлемент();
			СпрОбъект.Наименование = Наименование;
			
		КонецЕсли;
		
		СпрОбъект.ИмяКлассаРенга = ИмяКлассаРенга;
		СпрОбъект.ИдентификаторРенга = ИдентификаторРенга;
		
		СпрОбъект.Записать();
		
	КонецЦикла;
	
	Возврат Истина;

КонецФункции

#КонецОбласти
